import webbrowser

__author__ = 'Буров А.С.'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...

while True:
    var_num = input('Введите целое число: ')
    if var_num.isdigit() is True:
        var_num = int(var_num)
        break
    else:
        print('Вы указали не целое число!')

i = 1
num_string = 'Результат: '

while i <= var_num:
    if i == 1:
        print('Выполняем цикл WHILE (от', i, 'до', var_num, ')')
    num_string = num_string + str(i) + ' '
    i += 1
print(num_string)

num_string = 'Результат: '

for i in range(var_num):
    if i == 0:
        print('Выполняем цикл FOR (от', (i + 1), 'до', var_num, ')')
    num_string = num_string + str(i + 1) + ' '
    i += 1
print(num_string)

num_string = 'Результат: '
inform = True;
while 0 < var_num:
    if inform is True:
        print('Выполняем цикл WHILE: (-1 от числа ', var_num, ')')
        inform = False
    var_num -= 1
    num_string = num_string + str(var_num) + ' '

print(num_string)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

question_dict = {
    'step1': 'Укажите значение первой переменной: ',
    'step2': 'Укажите значение второй переменной: '
}

counter = 0
for i in question_dict:
    while True:
        user_answer = input(question_dict[i])
        if user_answer.isdigit() is True:
            user_answer = int(user_answer)
            counter += 1
            question_dict[i] = [('Переменная ' + str(counter)) + ':', user_answer]
            break
        else:
            print('Вы указали не целое число!\nПовторите позззязя :)')


print(
    question_dict['step1'][0], '=', question_dict['step1'][1], '\n',
    question_dict['step2'][0], '=', question_dict['step2'][1]
)

if question_dict['step1'][1] == question_dict['step2'][1]:
    print('Переменные равны! Переопределения значения — не возможно LOL!')
else:
    _num = question_dict['step1'][1]
    question_dict['step1'][1] = question_dict['step2'][1]
    question_dict['step2'][1] = _num

print('Результат замены значений:\n',
    question_dict['step1'][0], '=', question_dict['step1'][1], '\n',
    question_dict['step2'][0], '=', question_dict['step2'][1]
)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
_smile = """--------------------------------------------
_________________________$$$$$$$
________________________$$$$$$$$$$
________________________$$$$$$$$$$$
_________________________$$$$$$$$$$$$$$
__________________________$$$$$$$$$$$
_____________________________$$$$$$$$$$$$$
___________________________$$$$$$$$$$
_________________________$$$$$$$$$$$$$$$
________________$$$______$$$$$$$$$$$$$$
______________$$$$$$$$_____$$$$$$__$$$$$
_____________$$$$$$$$$$_____$$$$____$$$$$
___________$$$$$$_$$$$$$$$__$$$$______$$$$
__________$$$$$_____$$$$$$$$_$$$$_______$$
________$$$$$_________$$$$$$$$$$$$_______$
_______ $$$_____________$$$$$$$$$$$
_____$$$________________$$$$$$$$$$
__$$$$$$__________________$$$$$$$"""

if (int(input('Сколько вам лет? ')) >= 18):
    print("Доступ разрешен :)")
    webbrowser.open('https://www.xvideos.com/')
else:
    print('Извините, пользование данным ресурсом только с 18 лет!')
    print(_smile)



