__author__ = 'Буров А.С.'
import math
# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# # 	Код: a == a**2
# # 	Результат: True
# # 	Код: a == a*2
# # 	Результат: True
# # 	Код: a > 999999
# # 	Результат: True

# 25 == 5 ** 2
# 25 =
# МОЗГ ПОЛОМАЛ :( нашёл решение в интернете; :(
a = float('inf')
print(a)
print(a == a**2)
print(a == a*2)
print(a > 999999)

# start = 999999
# i = start
# while i+1:
#     x = i
#     if (x*2 == x**2) is True:
#         print('Загаданное число: ',x)
#         break
#     print(x)
#     i +=1


# start = 999999
# i = start + 1
# while i > start:
#     if (i == i**2) is True:
#         print('i == i**2: ', i)
#         if (i == i*2) is True:
#             print('i == i*2: ', i)
#             if (i > start) is True:
#                 print('Загаданное число: ',i)
#                 break
#     print('no ',i)
#     i +=1


# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)